app/views/question_answer/result.html.erb

SELECT `answers`.* FROM `answers`
---

        for (let i = 0; i < this.answers.length; i++) {